src/cf/DataProcessors/ФормированиеАктовВзаимозачета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеАктовВзаимозачета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыФормирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетПоставщика</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПокупателя</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТОП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/cf/DataProcessors/ФормированиеАктовВзаимозачета/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	Если Команда.Имя="СформироватьАктВзаимозачета" Тогда
		СформироватьАктВзаимозачета();

	ИначеЕсли Команда.Имя="ЗаполнитьПоУмолчаниюПараметрыФормирования" Тогда
		ЗаполнитьПоУмолчаниюПараметрыФормирования();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюПараметрыФормирования()
	Выборка=Справочники.ТиповыеОперации.Выбрать(,Справочники.ИдентификаторыОбъектовМетаданных.Документ_АктВзаимозачета);
	Пока Выборка.Следующий() Цикл
		ПроводкиБУ=Выборка.ПроводкиБУ;
		Если ПроводкиБУ.Количество()=0 Тогда Возврат; КонецЕсли; 
		НоваяСтрока=Объект.ПараметрыФормирования.Добавить();
		НоваяСтрока.СчетПоставщика=ПроводкиБУ[0].СчетДебет;
		НоваяСтрока.СчетПокупателя=ПроводкиБУ[0].СчетКредит;
		НоваяСтрока.ТОП=Выборка.Ссылка;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатЗапроса(СчетПоставщика, СчетПокупателя)
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	|	ХозрасчетныйОстатки.Субконто2 КАК Договор,
	|	ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаПокупателя,
	|	0 КАК СуммаПоставщика
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаОстатков,
	|			Счет = &СчетПокупателя,
	|			,
	|			Организация = &Организация) КАК ХозрасчетныйОстатки
	|				
	|ОБЪЕДИНИТЬ ВСЕ				
	|				
	|				
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто2,
	|	0,
	|	ХозрасчетныйОстатки.СуммаОстатокКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаОстатков,
	|			Счет = &СчетПоставщика,
	|			,
	|			Организация = &Организация) КАК ХозрасчетныйОстатки";
	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(КонецДня(Объект.НаДату),ВидГраницы.Включая)); 			 
	Запрос.УстановитьПараметр("СчетПокупателя", СчетПокупателя);
	Запрос.УстановитьПараметр("СчетПоставщика", СчетПоставщика);
	Запрос.УстановитьПараметр("Организация", Объект.Организация); 
	тзДанные=Запрос.Выполнить().Выгрузить();
	тзДанные.Свернуть("Контрагент,Договор","СуммаПокупателя,СуммаПоставщика");
	
	Возврат тзДанные;
КонецФункции

&НаСервере
Функция ПолучитьРезультатЗапросаПоДокументам62(СчетПокупателя, Контрагент, Договор)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ДатаКонца", Новый Граница(КонецДня(Объект.НаДату),ВидГраницы.Включая)); 			 
	Запрос.УстановитьПараметр("СчетПокупателя", СчетПокупателя);
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 500
	|	ХозрасчетныйОбороты.Субконто1 КАК Контрагент,
	|	ХозрасчетныйОбороты.Субконто2 КАК Договор,
	|	ХозрасчетныйОбороты.Регистратор.Дата КАК Дата,
	|	ХозрасчетныйОбороты.Регистратор КАК Документ,
	|	ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаПокупателя,
	|	0 КАК СуммаПоставщика,
	|	ХозрасчетныйОбороты.Период КАК Период
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			,
	|			&ДатаКонца,
	|			Регистратор,
	|			Счет = &СчетПокупателя,
	|			,
	|			Организация = &Организация И Субконто1 = &Контрагент И Субконто2 = &Договор,
	|			,
	|			) КАК ХозрасчетныйОбороты
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	тзРегистратор62=Запрос.Выполнить().Выгрузить();
	тзРегистратор62.Сортировать("Дата Убыв");
	
	Возврат тзРегистратор62;
КонецФункции	

&НаСервере
Функция ПолучитьРезультатЗапросаПоДокументам60(СчетПоставщика, Контрагент, Договор)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ДатаКонца", Новый Граница(КонецДня(Объект.НаДату),ВидГраницы.Включая)); 			 
	Запрос.УстановитьПараметр("СчетПоставщика", СчетПоставщика);
	Запрос.УстановитьПараметр("Организация", Объект.Организация); 
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 500
	|	ХозрасчетныйОбороты.Субконто1 КАК Контрагент,
	|	ХозрасчетныйОбороты.Субконто2 КАК Договор,
	|	ХозрасчетныйОбороты.Регистратор.Дата КАК Дата,
	|	ХозрасчетныйОбороты.Регистратор КАК Документ,
	|	0 КАК СуммаПокупателя,
	|	ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаПоставщика,
	|	ХозрасчетныйОбороты.Период КАК Период
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(,&ДатаКонца, Регистратор, Счет = &СчетПоставщика,,
	|			Организация = &Организация И Субконто1 = &Контрагент И Субконто2 = &Договор,,
	|			) КАК ХозрасчетныйОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ
	|";
	тзРегистратор60=Запрос.Выполнить().Выгрузить();
	тзРегистратор60.Сортировать("Дата Убыв");
	
	Возврат тзРегистратор60;
КонецФункции	

&НаСервере
Процедура СформироватьАктВзаимозачета()
	//Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
	//	ПоказатьПредупреждение(, "Не заполнен реквизит <организация> !", 10);
	//	Возврат;
	//КонецЕсли;
	
	ВалютаБух=МодульВалютногоУчета.ПолучитьВалюту("Бух");
	СтруктураКурса=МодульВалютногоУчета.КурсВалюты(ВалютаБух, КонецДня(Объект.НаДату));
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.ПараметрыФормирования Цикл
		тзДанные=ПолучитьРезультатЗапроса(СтрокаТабличнойЧасти.СчетПоставщика, СтрокаТабличнойЧасти.СчетПокупателя);
		Если тзДанные.Количество()=0 Тогда Продолжить; КонецЕсли;
		тзКонтрагенты=тзДанные.Скопировать(, "Контрагент");
		тзКонтрагенты.Свернуть("Контрагент", "");
		
		Для Каждого СтрокаКоллекции Из тзКонтрагенты Цикл
			СтруктураОтбора=Новый Структура("Контрагент", СтрокаКоллекции.Контрагент);
			МассивСтрок=тзДанные.НайтиСтроки(СтруктураОтбора);
			тзДанныеКонтрагента=тзДанные.Скопировать(МассивСтрок);
			Если тзДанныеКонтрагента.Итог("СуммаПокупателя")=0 ИЛИ тзДанныеКонтрагента.Итог("СуммаПоставщика")=0 Тогда Продолжить; КонецЕсли;
			
			//Создаем документ "Акт взаимозачета"
			Док=Документы.АктВзаимозачета.СоздатьДокумент();
			Док.ВалютаДокумента=ВалютаБух;
			Док.КурсДокумента=СтруктураКурса.Курс;
			Док.КратностьДокумента=СтруктураКурса.Кратность;
			Док.Дата=КонецДня(Объект.НаДату);
			Док.Организация=Объект.Организация;
			Док.Ответственный=ПараметрыСеанса.ТекущийПользователь;
			Док.ТОП=СтрокаТабличнойЧасти.ТОП;
			Док.КонтрагентКредитор=СтрокаКоллекции.Контрагент;
			Док.КонтрагентДебитор=СтрокаКоллекции.Контрагент;
			Док.Комментарий="Документ сформирован автоматически";
			
			тзДолгКредитора=Док.ДолгКредитора.ВыгрузитьКолонки();
			тзДолгКредитора.Колонки.Добавить("Дата");
			тзДолгДебитора=Док.ДолгДебитора.ВыгрузитьКолонки();
			тзДолгДебитора.Колонки.Добавить("Дата");
			
			Для Каждого СтрокаДоговора ИЗ тзДанныеКонтрагента Цикл
				тзРегистратор62=ПолучитьРезультатЗапросаПоДокументам62(СтрокаТабличнойЧасти.СчетПокупателя,СтрокаДоговора.Контрагент,СтрокаДоговора.Договор);
				тзРегистратор60=ПолучитьРезультатЗапросаПоДокументам60(СтрокаТабличнойЧасти.СчетПоставщика,СтрокаДоговора.Контрагент,СтрокаДоговора.Договор);
				
				СуммаПоставщика=СтрокаДоговора.СуммаПоставщика;
				Для КАждого СтрокаМ ИЗ тзРегистратор60 Цикл
					Если СтрокаМ.СуммаПоставщика<=0 Тогда Продолжить; КонецЕсли;
					Если СуммаПоставщика=0 Тогда Прервать; КонецЕсли;
					НоваяСтрока=тзДолгКредитора.Добавить();
					текВалюта=СтрокаМ.Договор.ВалютаВзаиморасчетов;
					СтруктураКурса=МодульВалютногоУчета.КурсВалюты(текВалюта, КонецДня(Объект.НаДату));
					
					НоваяСтрока.КурсВзаиморасчетов=СтруктураКурса.Курс;
					НоваяСтрока.КратностьВзаиморасчетов=СтруктураКурса.Кратность;
					НоваяСтрока.ДоговорКонтрагента=СтрокаМ.Договор;
					НоваяСтрока.Дата=СтрокаМ.Дата;
					Если СуммаПоставщика<СтрокаМ.СуммаПоставщика Тогда
						НоваяСтрока.СуммаРегл=СуммаПоставщика;
						НоваяСтрока.СуммаНДС=?(Док.КонтрагентКредитор.УчетБезНДС,0,НоваяСтрока.СуммаРегл*18/118);
						НоваяСтрока.ДокументРасчетовСКонтрагентом=СтрокаМ.Документ;
						СуммаПоставщика=0;
						Док.ПересчитатьСуммуПоСтроке(НоваяСтрока);
						Продолжить;
					КонецЕсли;	
					Если СуммаПоставщика>=СтрокаМ.СуммаПоставщика Тогда
						НоваяСтрока.СуммаРегл=СтрокаМ.СуммаПоставщика;
						НоваяСтрока.СуммаНДС=?(Док.КонтрагентКредитор.УчетБезНДС,0,НоваяСтрока.СуммаРегл*18/118);
						НоваяСтрока.ДокументРасчетовСКонтрагентом=СтрокаМ.Документ;
						СуммаПоставщика=СуммаПоставщика-СтрокаМ.СуммаПоставщика;
						Док.ПересчитатьСуммуПоСтроке(НоваяСтрока);
						Продолжить;
					КонецЕсли;	
				КонецЦикла;	
				Если НЕ СуммаПоставщика=0 Тогда 
					НоваяСтрока=тзДолгКредитора.Добавить();
					текВалюта=СтрокаДоговора.Договор.ВалютаВзаиморасчетов;
					СтруктураКурса=МодульВалютногоУчета.КурсВалюты(текВалюта, КонецДня(Объект.НаДату));
					
					НоваяСтрока.КурсВзаиморасчетов=СтруктураКурса.Курс;
					НоваяСтрока.КратностьВзаиморасчетов=СтруктураКурса.Кратность;
					НоваяСтрока.ДоговорКонтрагента=СтрокаДоговора.Договор;
					НоваяСтрока.СуммаРегл=СуммаПоставщика;
					НоваяСтрока.СуммаНДС=?(Док.КонтрагентКредитор.УчетБезНДС,0,НоваяСтрока.СуммаРегл*18/118);
					Док.ПересчитатьСуммуПоСтроке(НоваяСтрока);
				КонецЕсли;
				
				СуммаПокупателя=СтрокаДоговора.СуммаПокупателя;
				Для КАждого СтрокаМ ИЗ тзРегистратор62 Цикл
					Если СтрокаМ.СуммаПокупателя<=0 Тогда Продолжить; КонецЕсли;
					Если СуммаПокупателя=0 Тогда Прервать; КонецЕсли;
					НоваяСтрока=тзДолгДебитора.Добавить();
					текВалюта=СтрокаМ.Договор.ВалютаВзаиморасчетов;
					СтруктураКурса=МодульВалютногоУчета.КурсВалюты(текВалюта, КонецДня(Объект.НаДату));
					
					НоваяСтрока.КурсВзаиморасчетов=СтруктураКурса.Курс;
					НоваяСтрока.КратностьВзаиморасчетов=СтруктураКурса.Кратность;
					
					НоваяСтрока.ДоговорКонтрагента=СтрокаМ.Договор;
					НоваяСтрока.Дата=СтрокаМ.Дата;
					Если СуммаПокупателя<СтрокаМ.СуммаПокупателя Тогда
						НоваяСтрока.СуммаРегл=СуммаПокупателя;
						НоваяСтрока.СуммаНДС=?(Док.КонтрагентДебитор.УчетБезНДС,0,НоваяСтрока.СуммаРегл*18/118);
						НоваяСтрока.ДокументРасчетовСКонтрагентом=СтрокаМ.Документ;
						СуммаПокупателя=0;
						Док.ПересчитатьСуммуПоСтроке(НоваяСтрока);
						Продолжить;
					КонецЕсли;	
					Если СуммаПокупателя>=СтрокаМ.СуммаПокупателя Тогда
						НоваяСтрока.СуммаРегл=СтрокаМ.СуммаПокупателя;
						НоваяСтрока.СуммаНДС=?(Док.КонтрагентДебитор.УчетБезНДС,0,НоваяСтрока.СуммаРегл*18/118);
						НоваяСтрока.ДокументРасчетовСКонтрагентом=СтрокаМ.Документ;
						СуммаПокупателя=СуммаПокупателя-СтрокаМ.СуммаПокупателя;
						Док.ПересчитатьСуммуПоСтроке(НоваяСтрока);
						Продолжить;
					КонецЕсли;	
				КонецЦикла;
				Если НЕ СуммаПокупателя=0 Тогда 
					НоваяСтрока=тзДолгДебитора.Добавить();
					текВалюта=СтрокаДоговора.Договор.ВалютаВзаиморасчетов;
					СтруктураКурса=МодульВалютногоУчета.КурсВалюты(текВалюта, КонецДня(Объект.НаДату));
					
					НоваяСтрока.КурсВзаиморасчетов=СтруктураКурса.Курс;
					НоваяСтрока.КратностьВзаиморасчетов=СтруктураКурса.Кратность;
					НоваяСтрока.ДоговорКонтрагента=СтрокаДоговора.Договор;
					НоваяСтрока.СуммаРегл=СуммаПокупателя;
					НоваяСтрока.СуммаНДС=?(Док.КонтрагентДебитор.УчетБезНДС,0,НоваяСтрока.СуммаРегл*18/118);
					Док.ПересчитатьСуммуПоСтроке(НоваяСтрока);
				КонецЕсли;
			КонецЦикла;	
			тзДолгКредитора.Сортировать("Дата Возр");
			Док.ДолгКредитора.Загрузить(тзДолгКредитора);
			тзДолгДебитора.Сортировать("Дата Возр");
			Док.ДолгДебитора.Загрузить(тзДолгДебитора);
			
			Итого_ДолгКредитора=Док.ДолгКредитора.Итог("СуммаРегл");
			Итого_ДолгДебитора=Док.ДолгДебитора.Итог("СуммаРегл");
			Если Итого_ДолгКредитора=0 ИЛИ Итого_ДолгДебитора=0 Тогда Продолжить; КонецЕсли; 				
			
			Док.СуммаДокумента=Мин(Итого_ДолгКредитора, Итого_ДолгДебитора);
			Док.Упаковать(Док.ДолгКредитора);
			Док.Упаковать(Док.ДолгДебитора);
			Док.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Управление настройками

&НаСервере
Процедура НастройкиВосстановить()
	УстановитьПривилегированныйРежим(Истина);
	Настройки=ХранилищеОбщихНастроек.Загрузить("ФормированиеАктовВзаимозачета", "ФормированиеАктовВзаимозачета",,ПараметрыСеанса.ТекущийПользователь); 
	УстановитьПривилегированныйРежим(Ложь);

	Если ТипЗнч(Настройки)=Тип("Структура") Тогда
		Настройки.Свойство("Организация", Объект.Организация);
		Для каждого СтрокаКоллекции Из Настройки.ПараметрыФормирования Цикл
			ЗаполнитьЗначенияСвойств(Объект.ПараметрыФормирования.Добавить(), СтрокаКоллекции);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НастройкиСохранить()
	УстановитьПривилегированныйРежим(Истина);

	СтруктураПараметров=Новый Структура;
	СтруктураПараметров.Вставить("ПараметрыФормирования", Объект.ПараметрыФормирования.Выгрузить());
	СтруктураПараметров.Вставить("Организация", Объект.Организация);
	ХранилищеОбщихНастроек.Сохранить("ФормированиеАктовВзаимозачета", "ФормированиеАктовВзаимозачета", СтруктураПараметров,,ПараметрыСеанса.ТекущийПользователь);

	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.НаДату=КонецМесяца(ТекущаяДата());
	НастройкиВосстановить();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗавершениеРаботы Тогда
		НастройкиСохранить();
	КонецЕсли;	 
КонецПроцедуры
